app/Http/Controllers/AuthController.php

    public function registrationPost (Request $request) {
        $input = $request->all();

        $this->validate($request, [
            'name' => 'required|min:3|max:60|unique:users,name',
            'email' => 'required|email|unique:users,email',
            'phone' => 'regex:/\+\d{1}\s{1}\(\d{3}\)\s{1}\d{3}\-\d{2}\-\d{2}/',
            'login' => 'required|min:3|max:60|', //unique:users,login
            'password' => 'required|min:6|max:60',
            'password2' => 'required|same:password',
            'about' => 'max:500'
            //'is_confirmed' => 'accepted'
    ]);
        $id = DB::table('users')->insertGetId(
            ['name' => $input['name'],
             'email' => $input['email'],
             'password' => bcrypt($input['password']),
              'created_at' => date('Y-m-d H:i:s'),
              'updated_at' => date('Y-m-d H:i:s'),
            ]
        );
---
insert into `users` (`name`, `email`, `password`, `created_at`, `updated_at`) values ('admin', 'adnim@admin.ru', 'y$EV8rKGjvv04nKvsMiBnvAecH2FPGy852N0H/aLD8m3P18Yoge3ihK', '2018-09-08 19:54:39', '2018-09-08 19:54:39')